#+TITLE: 线程
#+AUTHOR: DarkSun
#+CATEGORY: Programming, AUPE
#+DATE: [2015-05-28 周四 12:48]
#+OPTIONS: ^:{}

** pthread_exit函数说明
#+BEGIN_SRC C
  #include <pthread.h>

  void pthread_exit(void* rtn_val);
#+END_SRC
其中参数rtn_val为线程退出的返回值. 其他进程可以使用`pthread_join'函数访问 *这个指针*.

实际使用时,rtn_val不一定就是指针类型,也可能被强制转换为整型. 
但若rtn_val为指针类型,则需要保证 *指针所指的内容在调用者完成调用后仍然有效(全局变量或在堆上分配空间)*
#+BEGIN_SRC C :exports both :results raw
  #include <pthread.h>
  #include <stdio.h>

  void* thread_func1(void* arg)
  {
    printf("thread running. ");
    return ((void*) 1);           /* 这里将整型强制转换为指针 */
  }

  void* thread_func2(void* arg)
  {
    printf("thread running. ");
    char* rtn = malloc(sizeof("I am thread 2") + 1);
    strcpy(rtn,"I am thread 2");
    return ((void*) rtn);           /* 这里返回一个指向字符数组的指针 */
  }
  int main()
  {
    pthread_t tid;
    void* thread_rtn;

    pthread_create(&tid,NULL,thread_func1,NULL);
    pthread_join(tid,&thread_rtn);
    printf("thread returns %d\n",(int)thread_rtn);

    pthread_create(&tid,NULL,thread_func2,NULL);
    pthread_join(tid,&thread_rtn);
    printf("thread returns %s\n",(char*)thread_rtn);
    free((char*)thread_rtn);
    return 0;
  }
#+END_SRC

#+RESULTS:
thread running. thread returns 1
thread running. thread returns I am thread 2

** pthread_cancel
pthread_cancel函数用来 *请求(并不能强制)* 取消同一进程中的其他线程
#+BEGIN_SRC C
  #include <pthread.h>

  /* 成功返回0,否则返回错误编号 */
  int pthread_cancel(pthread_t tid);
#+END_SRC
默认情况下,pthread_cancel函数会使得指定线程的行为表现如同调用了`pthread_exit(PTHREAD_CANCELED)'. 但,线程可以选择 *忽略取消,或采用其他的取消方式*
#+BEGIN_SRC C :exports both :results drawer
  #include <pthread.h>
  #include <stdio.h>

  void* thread_func(void* arg)
  {
    printf("thread running");
    sleep(10);
    return (void*) 100;
  }

  int main()
  {
    pthread_t tid;
    void* thread_rtn;

    pthread_create(&tid,NULL,thread_func,NULL);
    pthread_cancel(tid);
    pthread_join(tid,&thread_rtn);
    if(thread_rtn == PTHREAD_CANCELED)
      {
        printf("thread returned PTHREAD_CANCELED");
      }
    else
      {
        printf("thread returned %d",(int)thread_rtn);
      }
    return 0;
  }
#+END_SRC

#+RESULTS:
:RESULTS:
thread runningthread returned PTHREAD_CANCELED
:END:

另外需要注意的是, *默认情况下, 线程在取消请求发出后并不会立即退出,而是会继续运行,直到线程到达某个取消点*. 取消点常在线程调用某些函数时出现.

若应用程序在很长时间内都不会调用到产生取消点的函数,则可以调用`pthread_testcancel'函数在程序中自己添加取消点.
#+BEGIN_SRC C
  #include <pthread.h>

  void pthread_testcancel();
#+END_SRC
** 线程清理函数
类似进程,线程也可以安排它退出时要调用的函数. 这些类似atexit的函数被称为线程清理处理函数.

线程也可以建立多个清理处理函数,它们的指向顺序与注册顺序相反.
#+BEGIN_SRC C
  #include <pthread.h>

  /* 注册清理函数,及参数 */
  void pthread_cleanup_push(void (*clean_func)(void*),void* arg);

  /* 删除上次注册的清理函数,参数execute表示删除前知否执行这些清理函数 */
  void pthread_cleanup_pop(int execute);
#+END_SRC
在 *pthread_cleanup_push和pthread_cleanup_pop间的代码段* 中若有终止动作(包括被取消),都将执行pthread_cleanup_push()所注册的清理函数.

*pthread_cleanup_push和pthread_cleanup_pop必须成对出现!*
#+BEGIN_SRC C :exports both :results drawer
  #include <pthread.h>
  #include <stdio.h>

  void cleanup(void* arg)
  {
    printf("cleanup:%s\n",(char*)arg);
  }

  void* thread_func(void* arg)
  {
    pthread_cleanup_push(cleanup,(void*)"thread first cleanup handler");
    pthread_cleanup_push(cleanup,(void*)"thread second cleanup handler");
    printf("running thread\n");
    pthread_cleanup_pop(1);      /* 没有退出,但execute为1表示弹出第2个处理函数时也要执行该函数 */
    if(arg == NULL)
      {
        pthread_exit(arg);
        /* return arg; */
      }
    pthread_cleanup_pop(0);
    return arg;
  }

  int main()
  {
    pthread_t tid;
    void* rtn_value;

    pthread_create(&tid,NULL,thread_func,(void*)NULL);
    pthread_join(tid,&rtn_value);

    pthread_create(&tid,NULL,thread_func,(void*)1);
    pthread_join(tid,&rtn_value);

    return 0;
  }
#+END_SRC

#+RESULTS:
:RESULTS:
running thread
cleanup:thread second cleanup handler
cleanup:thread first cleanup handler
running thread
cleanup:thread second cleanup handler
:END:

* 多线程环境下的fork
父进程fork出的子进程会继承父进程的所有互斥量,读写锁和条件变量的状态,但是却只有线程,即父进程中调用fork的那个线程.

因此若父进程中的那些同步变量被其他线程占用,则子进程同样占有这些锁,但同时子进程并没有占有锁的其他线程存在,所以子进程需要在fork的同时清理掉那些被其他线程占用的锁(若子进程立即exec则无此必要)

要清除锁状态,需要在父进程中调用`pthread_atfork'函数创建fork处理程序.
#+BEGIN_SRC C 
  #include <pthread.h>

  /* 成功返回0,否则返回错误编号 */
  int pthread_atfork(void (*prepare)(void),
                     void (*parent)(void),
                     void (*child)(void));
#+END_SRC

+ 参数prepare会在父进程fork子进程前被调用,它的任务是获取父进程中 *所有线程中* 定义的 *所有锁*
+ 参数parent会在fork创建子进程后,但在fork返回前在 *父进程环境* 中调用的,它的任务是对prepare中获得的锁进行解锁
+ 参数child会在fork创建子进程后,但在fork返回前在 *子进程环境* 中调用,它的任务也是对prepare中获得的锁进行解锁
+ 若参数为NULL,则表示不设置该函数
#+BEGIN_SRC C :exports both :results drawer
  #include <stdio.h>
  #include <pthread.h>
  #include <unistd.h>

  pthread_mutex_t lock1 = PTHREAD_MUTEX_INITIALIZER;
  pthread_mutex_t lock2 = PTHREAD_MUTEX_INITIALIZER;

  void prepare()
  {
    printf("preparing locks...\n");
    pthread_mutex_lock(&lock1);   /* 获取锁1 */
    pthread_mutex_lock(&lock2);   /* 获取锁2 */
  }

  void parent()
  {
    printf("parent unlocking locks...\n");
    pthread_mutex_unlock(&lock1); /* 释放锁1 */
    pthread_mutex_unlock(&lock2); /* 释放锁2 */
  }

  void child()
  {
    printf("child unlocking locks...\n");
    pthread_mutex_unlock(&lock1); /* 释放锁1 */
    pthread_mutex_unlock(&lock2); /* 释放锁2 */
  }

  void* thread_func(void* arg)
  {
    printf("thread started...\n");
    pause();
    return 0;
  }

  int main()
  {
    pthread_atfork(prepare,parent,child);
    pthread_t tid;
    pthread_create(&tid,NULL,thread_func,0);
    sleep(2);
    printf("parent about to fork...\n");
    pid_t pid;
    if((pid = fork())< 0)
      printf("fork failed\n");
    else if(pid == 0)
      printf("child returned from fork\n");
    else
      printf("parent returned from fork\n");

    return 0;
  }
#+END_SRC

#+RESULTS:
:RESULTS:
thread started...
parent about to fork...
preparing locks...
child unlocking locks...
child returned from fork
thread started...
parent about to fork...
preparing locks...
parent unlocking locks...
parent returned from fork
:END:

可以多次调用pthread_at函数从而设置多套fork处理函数,但是每个参数被调用的顺序是不同的:
+ parent和child函数以它们注册的顺序进程调用
+ prepare处理函数的调用顺序与注册时的顺序相反
